In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': [5, 6, 7, 8, 9],
                   'C': ['a', 'b', 'c', 'd', 'e']})

In [3]:
df

   A  B  C
0  0  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [5]:
df['C'].replace(to_replace=['a','b'], value=['',''])

0
1
2    c
3    d
4    e
Name: C, dtype: object